blog/krunner-cwd.org
#+TITLE:       krunner工作目录在根目录的问题
#+AUTHOR:      shirui
#+EMAIL:       1229408499@qq.com
#+DATE:        2020-06-23 二
#+URI:         /blog/%y/%m/%d/krunner-cwd
#+KEYWORDS:    plasma, krunner, Linux
#+TAGS:        plasma, krunner, Linux
#+LANGUAGE:    zh
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 找到了如何避免krunner运行在根目录下的方法

* 前言
不知道有没有人在用 =plasma= 时发现和我一样的问题，有时 =Alt + Space= 打开 =konsole= 有时是 =root= 目录，有时是 =HOME= 目录。终端还好说直接 =cd= 就能跳转到 =HOME= 目录，但用 =emacs= 时就比较难受了。

在更新系统，切换版本等各种手段都用尽后我终于定位到 =BUG= 并且有比较方便的方法解决这个问题了。

* 问题与解决
我发现在桌面直接输入命令打开应用时会出现导致之后所以命令都是在 =root= 目录打开的，但使用 =Alt + Space= 命令打开 =krunner= 就不会有这个问题。

所以只需要改变一个用户习惯，一开机就按下快捷键就解决了。但根本问题还是没有解决，但继续查下去估计就要翻源码了，想探索的同学就继续吧，我给你加油。
