krunner-cwd.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="找到了如何避免krunner运行在根目录下的方法">
<link rel="alternate"
      type="application/rss+xml"
      href="https://lampze.github.io/rss.xml"
      title="RSS feed for https://lampze.github.io/">
<title>krunner工作目录在根目录的问题</title>
<meta  name="author" content="lampze" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/org.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
        <a href="https://lampze.github.io">lampze's Blog</a>
      </div></div>
<div id="content">
<div class="post-date">23 6月 2020</div><h1 class="post-title"><a href="https://lampze.github.io/krunner-cwd.html">krunner工作目录在根目录的问题</a></h1>

<div id="outline-container-org827e2ae" class="outline-2">
<h2 id="org827e2ae">前言</h2>
<div class="outline-text-2" id="text-org827e2ae">
<p>
不知道有没有人在用 <code>plasma</code> 时发现和我一样的问题，有时 <code>Alt + Space</code> 打开 <code>konsole</code> 有时是 <code>root</code> 目录，有时是 <code>HOME</code> 目录。终端还好说直接 <code>cd</code> 就能跳转到 <code>HOME</code> 目录，但用 <code>emacs</code> 时就比较难受了。
</p>

<p>
在更新系统，切换版本等各种手段都用尽后我终于定位到 <code>BUG</code> 并且有比较方便的方法解决这个问题了。
</p>
</div>
</div>

<div id="outline-container-org0e48e2b" class="outline-2">
<h2 id="org0e48e2b">问题与解决</h2>
<div class="outline-text-2" id="text-org0e48e2b">
<p>
我发现在桌面直接输入命令打开应用时会出现导致之后所以命令都是在 <code>root</code> 目录打开的，但使用 <code>Alt + Space</code> 命令打开 <code>krunner</code> 就不会有这个问题。
</p>

<p>
所以只需要改变一个用户习惯，一开机就按下快捷键就解决了。但根本问题还是没有解决，但继续查下去估计就要翻源码了，想探索的同学就继续吧，我给你加油。
</p>
</div>
</div>
<div class="taglist"><a href="https://lampze.github.io/tags.html">Tags</a>: <a href="https://lampze.github.io/tag-plasma.html">plasma</a> <a href="https://lampze.github.io/tag-krunner.html">krunner</a> <a href="https://lampze.github.io/tag-linux.html">Linux</a> </div></div>
<div id="postamble" class="status"><center>
         <a rel="license" href="https://creativecommons.org/licenses/by-sa/3.0/"></a><br />
         <span xmlns:dct="https://purl.org/dc/terms/"
               href="https://purl.org/dc/dcmitype/Text"
               property="dct:title"
               rel="dct:type">
           https://lampze.github.io
         </span>
         by
         <a xmlns:cc="https://creativecommons.org/ns#"
              href="https://lampze.github.io"
              property="cc:attributionName"
              rel="cc:attributionURL">
           lampze
         </a>
         is licensed under a
         <a rel="license"
            href="https://creativecommons.org/licenses/by-sa/3.0/">
           Creative Commons Attribution-ShareAlike 3.0 Unported License
         </a>.
       </center>
       <script type="text/javascript" src="static/main.js"></script></div>
</body>
</html>
